{"type":"FeatureCollection","features":[{"type":"Feature","properties":{"marker-color":"#7e7e7e","marker-size":"medium","marker-symbol":"","museumName":"Bulwagan ng Dangal","museumAdd":"University Main Library, Fernandez St.","museumDescrip":"The Bulwagan ng Dangal (BnD) provides a rich venue to sift through the growing University Art Collection, re-view, re-read and re-contextualize it to suit particular contemporary purposes and present it through various thematic exhibitions.","museumHours":"Tue – Fri: 10:00 am – 4:30 pm Sat: 10:00 am – 2:00 pm","museumSite":"http://www.facebook.com/pages/Bulwagan-ng-Dangal/378635625774","museumContact":"981-8500 loc. 2874"},"geometry":{"type":"Point","coordinates":[121.07100695371628,14.654431964646363]}},{"type":"Feature","properties":{"marker-color":"#7e7e7e","marker-size":"medium","marker-symbol":"","museumName":"UP College of Music Museum of Musical Instrume","museumAdd":"2nd Floor, Abelardo Hall, UP College of Music, Osmeña Avenue, Diliman, QC","museumDescrip":"An interactive museum wherein the musical instruments displayed are also featured in performances and audio-video presentations; also the venue for Musikolokya – an ongoing series of interdisciplinary fora on the subject of expressive culture, in particular, on music-culture – and for various other exhibits such as displays of original Philippine music manuscripts and memorabilia of Filipino composers","museumHours":"Monday to Friday, by appointment","museumSite":"n/a","museumContact":"981-8500 loc. 2635"},"geometry":{"type":"Point","coordinates":[121.06533408164978,14.657094372074559]}},{"type":"Feature","properties":{"marker-color":"#7e7e7e","marker-size":"medium","marker-symbol":"","museumName":"Costume Museum","museumAdd":"2nd floor of Alonso Hall, College of Home Economics, University of the Philippines Diliman","museumDescrip":"The College of Home Economics (CHE) Costume Museum is under the management of the CTID Department. It houses a collection of more than a thousand pieces of rare historic Filipino costumes and accessories (shoes, bags, belts, veils, hats, etc.). The museum’s collection is composed of rare and authentic items which represent a valuable segment of the historical development of the Filipino cultural heritage.","museumHours":"n/a","museumSite":"http://www.che-up.com","museumContact":"981-8500 loc. 3404"},"geometry":{"type":"Point","coordinates":[121.0732626914978,14.652112062791767]}},{"type":"Feature","properties":{"museumName":"UP NIGS-UPGAA Geology Museum","museumAdd":"National Institute of Geological Sciences Building G. Velasquez corner C.P. Garcia Streets University of the Philippines Diliman","museumDescrip":"The NIGS-UPGAA Geology Museum is located within the national center of excellence in geology in the premier national university of the country. The main focus of the museum is to serve as a teaching venue for earth science education in the Philippines. It is one of the few, if not the only museum of its kind in the Philippines that has a comprehensive display of types of minerals, rocks and fossils presented systematically.","museumHours":"Monday to Friday 8:00 am to 5:00 pm","museumContact":"924-2709","museumSite":"n/a"},"geometry":{"type":"Point","coordinates":[121.0696095228195,14.647856250576082]}},{"type":"Feature","properties":{"museumName":"Jose V. Santos Herbarium","museumAdd":"Pavilion IV, Institute of Biology, Quirino Avenue, UP Diliman","museumDescrip":"Houses a collection of approximately 20,000 specimens, chiefly vascular plants, including Grasses by Santos, Ferns by Zamora, general collections by Leonardo Co.","museumHours":"Monday to Friday, 8am to 5pm","museumContact":"981-8500 loc. 3728","museumSite":"n/a"},"geometry":{"type":"Point","coordinates":[121.07089698314665,14.650949507658565]}},{"type":"Feature","properties":{"museumName":"Ishmael Bernal Gallery","museumAdd":"UP Film Institute (Back of Main Theatre), Osmeña Ave. UP Diliman","museumDescrip":"An artist’s space flexible for multimedia exhibits and installations and perfect for intimate film screenings and cultural nights. The gallery is managed by the UP Film Institute of the UP College of Mass Communication.","museumHours":"Monday-Friday, 8:00 am – 5:00pm","museumSite":"http://www.filminstitute.upd.edu.ph","museumContact":"926-2722"},"geometry":{"type":"Point","coordinates":[121.06701850891113,14.657192979135738]}},{"type":"Feature","properties":{"museumName":"Jorge B. Vargas Museum and Filipiniana Research Center","museumAdd":"UP College of Arts ang Letters, Roxas Avenue, UP Campus, Diliman","museumDescrip":"Houses the Jorge Vargas collection and memorabilia, special exhibitions, and a permanent art collection.","museumHours":"Tuesday to Saturday, 9:00am to 5:00pm","museumSite":"http://vargasmuseum.upd.edu.ph/","museumContact":"981-8500 loc. 4023"},"geometry":{"type":"Point","coordinates":[121.06677174568176,14.653310941313492]}},{"type":"Feature","properties":{"museumName":"National Institute of Molecular Biology & Biotechnology","museumAdd":"NIMBB Bldg., National Science Complex, College of Science, UP Diliman","museumDescrip":"The National Institute of Molecular Biology & Biotechnology (NIMBB) of UP Diliman is a premier research and educational institution. The building was designed by Augusto M. Concio, former Dean of the UST College of Architecture.","museumSite":"http://www.nimbb.upd.edu.ph","museumContact":"981-8615","museumHours":"n/a"},"geometry":{"type":"Point","coordinates":[121.07159435749055,14.650679627906383]}},{"type":"Feature","properties":{"museumName":"Corredor Gallery","museumAdd":"UP College of Fine Arts, Bartlett Hall, Emilio Jacinto Street, UP Campus","museumDescrip":"The Corredor is the official gallery of the College of Fine Arts. It is managed by an Exhibitions Committee which  implements gallery programs and activities that aim to:  to provide art and exhibition design experience within academic and teaching contexts; enhance CFA’s capability as a repository of art in the university; and forge a dynamic artistic and cultural exchange program for faculty and students through linkages with cultural and corporate institutions here and abroad.","museumHours":"n/a","museumContact":"981-8732","museumSite":"http://up-cfa.com/the-college/corredor-gallery/"},"geometry":{"type":"Point","coordinates":[121.06168627738954,14.652568779192482]}},{"type":"Feature","properties":{"museumName":"UP Biology Invertebrate Museum","museumAdd":"Rm. 111, West wing of Zoology Building, Quirino Avenue, U.P. Diliman","museumDescrip":"The UP Biology Invertebrate Museum has just been recently opened, with the help of the Source of Solutions (SOS) Grant from the OVCRD. The facility has two main thrusts: restore and revitalise its display collection and research collection.","museumHours":"Monday to Friday, 8am to 5pm","museumContact":"981-8500 loc. 3730","museumSite":"http://www.biology.upd.edu.ph/invmuseum"},"geometry":{"type":"Point","coordinates":[121.0709774494171,14.652838656618217]}}]}